Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: The manager was out, so I left a message with his secretary.
hi: मेनेजर बाहर निकल चुके थे, इसलिए मैंने उनके सेक्रेटरी के हाथों संदेस थमा दिया.

source: I want to see the manager.
hi: मैं मैनेजर से मिलना चाह्ता हूँ।

source: Dead?
hi: मर चुका है?

source: I cooked dinner.
hi: मैंने रात का खाना पकाया।

source: I will go there in place of you.
hi: तुम्हारे बदले मैं वहाँ जाऊँगा।

source: Take back what you said about me being stingy.
hi: जो तुमने मेरे कंजूस होने के बारे में कहा था, उस बात को वापस लो।

source: It was easy for me to do so.
hi: यह मेरे लिए करना बहुत आसान था।

source: They were about to leave when I arrived there.
hi: जब मैं वहाँ पहुँचा, वे जाने वाले थे।

source: Is it necessary for me to attend the party?
hi: मेरा पार्टी में आना ज़रूरी है क्या?

source: It will take me no less than 10 hours to prepare for the exam.
hi: मुझे परीक्षा की तैयारी करने के लिए कम-से-कम दस घंटे लगेंगे।

source: It is impossible for me to answer the question.
hi: उस सवाल का जवाब देना मेरे लिये असंभव है।

source: Do you have to make a speech?
hi: तुम्हे भाषण देना होगा क्या?

source: I had hardly reached the school when the bell rang.
hi: मैं बस स्कूल पहुँचा ही था कि घंटी बज गई।

source: I found nothing but a pair of scissors.
hi: मुझे कैंचियों के अलावा और कुछ नहीं मिला।

source: Please bear in mind what I said.
hi: कृपया जो मैंने कहा उसे ध्यान में रखना.

source: I owe what I am to my friend.
hi: मैं जो भी हूँ मेरे दोस्त की वजह से हूँ।

source: I was about to go out, when he came to see me.
hi: मैं बाहर निकलने ही वाला था, जब वह मुझसे मिलने आया।

source: I will never forget your kindness so long as I live.
hi: मैं आपकी अच्छाई को कभी नहीं भूलूँगा।

source: If I am a fool, you are another.
hi: अगर मैं मूर्ख हूँ तो तुम भी हो।

source: I will explain it to her.
hi: मैं उसको यह बात समझाउँगा।

source: We are all anxious about your health.
hi: हम सब तुम्हारे स्वास्थ्य के लिए बहुत चिंतित हैं।

source: It is very important for us to know each other.
hi: हमारे लिए एक-दूसरे को समझना बहुत ज़रूरी है।

source: The day will come when space travel becomes possible.
hi: किसी दिन अंतरिक्ष में यात्रा करना मुमकिन होगा।

source: There are lots of things for us to think about.
hi: हमारे पास सोचने के लिए बहुत सारी बातें हैं।

source: It was not easy for us to find his house.
hi: हमारे लिए उसका घर ढूँढना आसान नहीं था।

source: Health is the most precious thing we have.
hi: हमारा स्वास्थ्य हमारी सबसे कीमती संपत्ति होती है।

source: I have two sons. One is in Nara and the other in Tsu.
hi: मेरे दो बेटे हैं। एक नारा में है और एक त्सू में।

source: We had no water to drink.
hi: हमारे पास पीने के लिए पानी नहीं था।

source: We had a little water.
hi: हमने थोडा पानी पीया.

source: We have two unused rooms in our house.
hi: हमारे पास घर में दो कमरे हैं जिनका हम इस्तेमाल नहीं कर रहे हैं।

source: Would you please call off our trip to Hong Kong?
hi: हमारी हाँग काँग की ट्रिप को कैनसल कर दोगे क्या?

source: Our meeting was quite accidental.
hi: हमारी मुलाकात ग़लती से हो गई।

source: What happened to our order?
hi: हमारे औरडर का क्या हुआ?

source: We study music.
hi: हम संगीत की पढ़ाई करते हैं।

source: We stayed with them all through the summer.
hi: हमने पूरी गर्मी उनके साथ बिताई।

source: We all stand by you to the last.
hi: हम सब आखिर तक तुम्हारा साथ देंगे।

source: We should try to understand one another.
hi: हमे एक-दूसरे को समझने की कोशिश करनी चाहिए।

source: We were chatting over tea.
hi: हम चाय पीते पीते गपशप कर रहे थे।

source: We have no school today.
hi: हमारी आज स्कूल से छुट्टी है।

source: This is how we make ice cream.
hi: ऐसे हम आइस-क्रीम बनाते है।

source: We often make mistakes.
hi: हम अक्सर ग़लतियाँ कर बैठते हैं।

source: We rested for a while.
hi: हमने थोड़ी देर आराम किया।

source: We enjoyed skating.
hi: हमे स्केटिंग करके मज़ा आया।

source: We saw the child get on the bus.
hi: हमने बच्चे को बस पर चढ़ते हुए देखा।

source: We calculated that we could reach the place within two weeks.
hi: हमने हिसाब लगाया कि हम वहाँ दो हफ़्तों में पहुँच सकते थे।

source: We were startled at the explosion.
hi: हम धमाके से डर गए।

source: We painted the door green.
hi: हमने दरवाज़े को हरे रंग से पोत दिया।

source: We were very tired.
hi: हम बहुत थक चुके थे।

source: We usually have breakfast at 7:30.
hi: हम आमतौर पर साढ़े सात बजे नाश्ता खाते हैं।

source: We learned Russian instead of French.
hi: हमने फ़्रांसीसी की जगह रूसी सिखी।

source: We'll cross the river in a boat.
hi: हम नाव में नदी को पार करेंगे।

source: We are all eager to know the truth.
hi: हम सब सच जानने के लिए बेचैन हैं।

source: We all live on the earth.
hi: हम सब धरती पर रहते हैं।

source: We lack nothing.
hi: हमे किसी भी चीज़ की कमी नहीं है।

source: We are given to regretting our past.
hi: हमें बीते हुए कल पर पछतावा करने की आदत है।

source: We hurried for fear we should be late for school.
hi: हमने जल्दी करी क्योंकि हमें डर था कि हमें स्कूल पहुँचने में देरी होजाएगी।

source: We must try to protect the environment.
hi: हमे पर्यावरण की रक्षा करने की कोशिश करनी चाहिए।

source: We bought a round table.
hi: हमने गोल मेज़ खरीदी।

source: We were in a hurry.
hi: हम जल्दी में थे।

source: We ate a hasty meal and left immediately.
hi: हमने जल्दी से खाना खाया और फिर तुरन्त निकल पड़े।

source: Will we arrive on time?
hi: हम समय पर पहुँच जाएँगे क्या?

source: We went for a walk in the forest.
hi: हम जंगल में सैर करने गए थे।

source: We must pay the tax.
hi: हमें टैक्स भरना पड़ेगा।

source: We walked around the pond.
hi: हम तालाब के आस-पास टहलें।

source: We speak Japanese.
hi: हम जापानी बोलते हैं।

source: We took it for granted that he would join us.
hi: हमने मान लिया था कि वह हमारे साथ आएगा।

source: We are to meet in front of his house.
hi: हम उसके घर के सामने मिलेंगे।

source: We call his son Jimmy.
hi: हम उसके बेटे को जिमी बुलाते हैं।

source: We must allow for his age.
hi: हमे उनकी उम्र का लिहाज भी करना चाहिए।

source: To what degree can we trust him?
hi: हम उस पर कितना भरोसा कर सकते हैं?

source: We regard him as our hero.
hi: हम उसे अपना हीरो मानते हैं।

source: We went swimming at the beach.
hi: हम समुद्रतट पर तैरने गएं।

source: We communicate with each other by telephone every day.
hi: हम रोज़ एक-दूसरे से फ़ोन पर बात करते हैं।

source: We have decided on leaving this town tomorrow morning.
hi: हमने इस नगर को कल सुबह छोड़ने का इरादा किया है।

source: We will have to call on our friends to help us.
hi: हमें अपने दोस्तों से मदद माँगनी पड़ेगी।

source: We went shopping with our friends.
hi: हम दोस्तों के साथ खरीददारी करने गए।

source: We got ready.
hi: हम तैयार हो गये।

source: We are good friends.
hi: हम अच्छे दोस्त हैं।

source: We were next-door neighbors.
hi: हम पड़ोसी हुआ करते थे।

source: Speaking.
hi: बोलना.

source: Don't ask me for money.
hi: मुझसे पैसे मत माँगो।

source: As for me, I am satisfied.
hi: मैं तो संतुष्ट हूँ।

source: It is difficult for me.
hi: वह मेरे लिए मुश्किल है।

source: It was hard for me to refuse his request.
hi: मेरे लिए उससे "ना" कहना बहुत मुश्किल था।

source: It is difficult for me to get up before six.
hi: मेरे लिए छः बजे से पहले उठना बहुत मुश्किल है।

source: I have no time to help you with the work.
hi: मेरे पास तुम्हारी काम में मदद करने के लिए समय नहीं है।

source: I have a friend who lives in England.
hi: मेरा एक दोस्त है जो इंग्लैंड में रहता है।

source: I have an uncle who lives in Kyoto.
hi: मेरे क्योतो में रहने वाले एक चाचा हैं।

source: I have no money with me.
hi: मेरे पास अभी कोई पैसे नहीं हैं।

source: I have two sisters, both of whom are married.
hi: मेरी दो बहनें हैं और दोनो की शादी हो चुकी है।

source: I've got one brother and two sisters.
hi: मेरा एक भाई और दो बहनें हैं।

source: I didn't know what to say to him.
hi: मुझे समझ में नहीं आ रहा था कि उससे क्या कहूँ।

source: Can I do anything?
hi: मैं कुछ कर सकता हूँ क्या?

source: It is no use asking me for money.
hi: मुझसे पैसे माँगने में कोई फ़ायदा नहीं है।

source: Do you wish me to help?
hi: तुम्हें मेरी मदद चहिए क्या?

source: I'm willing to help you if you want me to.
hi: अगर तुम मदद चाह्ते हो, तो मैं मदद करने के लिए तैयार हूँ।

source: Please give me a glass of water.
hi: मुझे एक गिलास पानी देदीजिए।

source: My family is small.
hi: मेरा परिवार छोटा है।

source: My uncle is an amateur cricket player.
hi: मेरे अंकल क्रिकेट के शौकिया खिलाड़ी हैं।

source: My favorite flavor is chocolate.
hi: मेरा पसंदीदा फ़्लेवर चाकलेट है।

source: My father is very nice.
hi: मेरे पिता बहुत अच्छे हैं।

source: My basket is under the table.
hi: मेरी टोकरी मेज़ के नीचे है।

source: My class is made up of forty students.
hi: मेरी क्लास में चालीस विद्यार्थी हैं।

source: Do you remember me?
hi: तुम्हें मैं याद हूँ क्या?

source: My jeans shrank in the wash.
hi: मेरी जीन्स पैंट धुलाई में सिकुड़ गई।

source: Will you make room for me?
hi: मेरे लिए थोड़ी जगह बनाओगे क्या?

source: You may use my pen.
hi: तुम मेरी कलम इस्तेमाल कर सकते हो।

source: My hens laid fewer eggs last year.
hi: मेरी मुर्गियों ने पिछले साल के मुकाबले से कम अंडे दियें हैं।

source: My dear little cat has been missing for a week.
hi: मेरी प्यारी सी नन्ही सी बिल्ली एक हफ़्ते से गायब है।

source: My opinion is entirely different from yours.
hi: मेरी सोच तुम्हारी सोच से बिलकुल अलग है।

source: There is a beautiful park near my home.
hi: मेरे घर के पास एक सुंदर बगीचा है।

source: A new building is being built in front of my house.
hi: मेरे घर के सामने एक नई ईमारत बन रही है।

source: My house is located at a distance from the station.
hi: मेरा घर स्टेशन से कुछ दूरी पर है।

source: What did you do with my baggage?
hi: तुमने मेरे सामान के साथ क्या किया?

source: My brother lives in Tokyo.
hi: मेरा भाई टोक्यो में रहता है।

source: This is all I have to say.
hi: मुझे बस इतना ही कहना है।

source: What I said hurt his pride.
hi: मेरी बात ने उसके अभिमान पर चोट पहुँचाई।

source: Please follow me.
hi: मेरे साथ आईए।

source: My country is far away from Japan.
hi: मेरा देश जापान से बहुत दूर है।

source: My wife really hates cats.
hi: मेरी बीवी को बिल्लियों से नफ़रत है।

source: My wife is Chinese.
hi: मेरी बीवी चीनी है।

source: Let me introduce my wife.
hi: यह मेरी पत्नी है।

source: Both of my sisters are married.
hi: मेरी दोनो बहनें शादीशुदा हैं।

source: My sister is very fond of children.
hi: मेरी बहन को बच्चों से बहुत प्यार है।

source: It's four o'clock by my watch.
hi: मेरी घड़ी के हिसाब से चार बजे हैं।

source: Answer me.
hi: मुझे जवाब दो।

source: My car is a Toyota.
hi: मेरी गाड़ी टोयोटा है।

source: My car is not running.
hi: मेरी गाड़ी चल नहीं रही है।

source: My hobby is playing the guitar.
hi: मेरा शौक गिटार बजाना है।

source: My hobby is collecting coins.
hi: सिक्कों को इकट्ठा करना मेरा शौक है।

source: My hobby is visiting old temples.
hi: मैं पुराने मंदिरों को देखने जाने का शौकीन हूँ।

source: According to my calculation, she should be in India by now.
hi: मेरे हिसाब के मुताबिक उसको अभी तक भारत पहुँच जाना चाहिए था।

source: Many friends of my youth also came.
hi: मेरे बचपन के कई दोस्त भी आये थे ।

source: That's my fault.
hi: वह मेरी गलती है।

source: My son can read a clock.
hi: मेरा बेटा घड़ी देखकर समय बता सकता है।

source: My birthday is one month from today.
hi: मेरा जन्मदिन आज से एक महीने में है।

source: My birthday is on March 22.
hi: मेरा जन्मदिन २२ मार्च को है।

source: To my knowledge, she has not left yet.
hi: जहाँ तक मुझे पता है वह अभी तक नहीं गयी.

source: My telephone is out of order.
hi: मेरा फ़ोन खराब है।

source: My girlfriend is an actress.
hi: मेरी गर्लफ्रेन्ड अभिनेत्री है।

source: My father usually comes home at six.
hi: मेरे पापा आमतौर पर छः बजे घर लौटकर आते हैं।

source: My father died of cancer.
hi: मेरे पिताजी कैंसर से चल बसे।

source: My father left me a lot of money in his will.
hi: मेरे पिता नें अपनी वसीयत में मुझे बहुत सारे पैसे छोड़े थे।

source: My father stopped smoking.
hi: मेरे पिता ने सिगरेट पीना बंद कर दिया।

source: My father doesn't like music.
hi: मेरे पिता को संगीत पसंद नहीं है।

source: My father spends a lot of time on his hobby.
hi: मेरे पिता अपने शौक पर बहुत समय खर्च करते हैं।

source: My father may be sleeping.
hi: मेरे पिता शायद सो रहे होंगे।

source: There is no TV in my room.
hi: मेरे कमरे में टीवी नहीं है।

source: My mother is constantly forgetting people's names.
hi: मेरी माँ अक्सर लोगों के नाम भूलती रहती है।

source: My mother often suffers from headaches.
hi: मेरी माँ को अक्सर सिरदर्द होता है।

source: Where's my book?
hi: मेरी किताब कहाँ है?

source: My daughter is in hospital because she was injured in a traffic accident.
hi: मेरी बेटी हस्पताल में है क्योंकि उसे यातायात दुर्घटना में चोट पहुँची है।

source: My name is omitted from the list.
hi: मेरा नाम सूची में नहीं आया।

source: My name is Yamada.
hi: मेरा नाम यामादा है।

source: My companion said that she was too tired to walk, let alone run.
hi: मेरी साथी ने कहा भागना तो छोड़ो, वह चलने ले किये भी थकी हुई है.

source: I watched the game from beginning to end.
hi: मैंने खेल को शुरू से अंत तक देखा।

source: I'm very tired.
hi: मैं बहुत थक गया हूँ।

source: I don't like summer.
hi: मुझे गर्मी का मौसम पसंद नहीं है।

source: I like dogs.
hi: मुझे कुत्ते अच्छे लगते हैं।

source: I am on holiday this week.
hi: मैं इस हफ़्ते छुट्टी पर हूं।

source: I have a car.
hi: मेरे पास एक गाड़ी है।

source: I am a student.
hi: मैं एक विध्यार्थी हूँ।

source: I shouldn't eat food that has sugar in it.
hi: मुझे चीनी-वाला चीज़ें नहीं खानी चाहिएँ।

source: I am a Japanese.
hi: मैं जापानी हूँ।

source: I truly loved her.
hi: मैं उससे सच्चा प्यार करता था।

source: I remember my mother teaching me the alphabet.
hi: मुझे याद है कि मेरी माँ ने मुझे क-ख-ग-ध सिखाए थे।

source: My name is Hisashi.
hi: मेरा नाम हिसाशी है।

source: I'm not a hundred percent wrong.
hi: मैं सौ प्रतिशत गलत नहीं हूँ।

source: I learned to play guitar when I was ten years old.
hi: मैंने दस साल की उम्र में ही गिटार बजाना सीख लिया था।

source: I left for America at ten o'clock.
hi: मैं दस बजे अम्रीका के लिए निकल गया।

source: I was born in Hiroshima in 1945.
hi: मेरा जन्म १९४५ में हिरोशिमा में हुआ था।

source: I was born in 1960.
hi: मैं १९६० में पैदा हुआ था।

source: I was born on June 4, 1974.
hi: मैं ४ जून, १९७४ को पैदा हुआ था।

source: I was born in Osaka in 1977.
hi: मेरा जन्म सन १९७७ में ओसाका में हुआ था।

source: I was born in 1979.
hi: मैं १९७९ में पैदा हुआ था।

source: I was able to win the first prize.
hi: मैंने प्रथम पुरस्कार जीत लिया।

source: I take a bath every other day.
hi: मैं हर दूसरे दिन नहाता हूँ।

source: I meet him once every six months.
hi: मैं उससे छः महीनों में एक बार मिलता हूँ।

source: I reached the station at six.
hi: मैं छः बजे स्टेशन पहुँचा।

source: I'm as tall as you.
hi: मैं तुम्हारे जितना लम्बा हूँ।

source: I'm glad to see you again.
hi: मैं तुम्हें फिरसे देखकर बहुत खुश हूँ।

source: I was ignorant of your plan.
hi: मुझे तुम्हारी योजना के बारे में जानकारी नहीं थी।

source: I want to know about your country.
hi: मैं आपके देश के बारे में जानना चाहता हूँ।

source: I want to help you with your homework.
hi: मैं तुम्हें तुम्हारे होमवर्क के साथ मदद करना चाहता हूँ।

source: I was asked to give you a message.
hi: मुझसे आपको यह संदेश देने के लिए बताया गया था।

source: I bet ten dollars on that horse.
hi: मैंने उस घोड़े पर दस डॉलर लगाए थे।

source: I don't have much money.
hi: मेरे पास ज़्यादा पैसे नहीं हैं।

source: I'm too tired to walk.
hi: मैं इतना थक गया हूँ कि मुझसे और चला नहीं जाएगा।

source: I watched an American drama.
hi: मैंने एक अमरीकी नाटक देखा।

source: I am interested in American literature.
hi: मुझे अम्रीकी साहित्य में दिलचस्पी है।

source: I'm looking for an old man.
hi: मैं एक बूढ़े आदमी की तलाश मे हूँ।

source: I know what that is.
hi: मुझे पता है कि वह चीज़ क्या है।

source: I fell down the stairs in my haste.
hi: अपनी ही जल्दबाज़ी मे मैं सीढ़ियों से नीचे गिर गया।

source: I made a mistake through doing it in a hurry.
hi: जल्दबाज़ी में करने के कारण मैंने एक ग़लती की।

source: I ran away in a hurry.
hi: मैं हड़बड़ी में दौड़ गया।

source: I went to Europe by way of Anchorage.
hi: आंकरेज होते हुए मैं युरोप गया।

source: I was lost in Sir Anthony's wonderful story.
hi: सर एंथनी की मज़ेदार कहानी मे मैं डूब गया।

source: I have never come across such a stubborn person.
hi: इतने अड़ियल व्यक्ति से मेरी कभी भी मुलाकात नहीं हुई है।

source: I've never met such a kind man.
hi: मैं कभी भी इतने दयालु व्यक्ति से नहीं मिला।

source: I'm staying in Italy.
hi: मैं इटली में रह रहा हूँ।

source: I was determined to help her at the risk of my life.
hi: मैं अपनी जान को जोखिम में डालकर भी उसकी मदद करने के लिए तैयार था।

source: I was on a trip to India.
hi: मैं भारत की यात्रा पर था।

source: I would like tea or coffee.
hi: मैं चाय या काफ़ी पसंद करूंगा।

source: I like tea.
hi: मुझे चाय पसंद है।

source: I've taught myself to play the guitar.
hi: मैंने खुद से गिटार बजाना सीख लिया है।

source: I like cake.
hi: मुझे केक अच्छा लगता है।

source: I am not keen on this kind of music.
hi: मुझे इस तरह का संगीत पसंद नहीं है।

source: I want to have a cup of coffee.
hi: मुझे एक कप कॉफ़ी चाहिए।

source: I had two cups of coffee.
hi: मैंने दो कप कॉफ़ी पी।

source: I haven't bought a new coat in five years.
hi: मैंने पाँच सालों में नया कोट नहीं ख़रीदा है।

source: I've worked here for ten years.
hi: मैं यहाँ दस साल से काम कर रहा हूँ।

source: I have been living here for three years.
hi: मैं यहां तीन सोलों से रहते आया हूं।

source: I am a stranger here.
hi: मुझे यहाँ पर अजनबी के जैसा महसूस होता है।

source: I don't know how to operate this computer.
hi: मुझे यह कम्प्यूटर चलाना नहीं आता।

source: I agree to this plan.
hi: मैं इस योजना से सहमत हूँ।

source: I want to know about this mountain.
hi: मुझे इस पहाड़ के बारे में जानना है।

source: I am familiar with this subject.
hi: मैं इस विषय से परिचित हूं।

source: I didn't go out last Sunday.
hi: मैं पिछले रविवार बाहर नहीं निकला था।

source: I can't put up with this noise anymore.
hi: मैं इस शोर को और बर्दाश्त नहीं कर सकती।

source: I've never played golf.
hi: मैने कभी गोल्फ़ नहीं खेला है।

source: Personally, I liked this one.
hi: व्यक्तिगत रूप से, मुझे यह वाला पसंद आया।

source: I can't drink coffee as sweet as this.
hi: मैं इतनी मीठी कॉफ़ी नहीं पी सकता।

source: I prefer walking to cycling.
hi: मुझे सायकल चलाना चलने से ज़्यादा पसंद है।

source: I shook hands with Jane.
hi: मैंने जेन से हाथ मिलाएं।

source: I followed the deer's tracks.
hi: मैंने हिरण के पैरों के निशानों का पीछा किया।

source: I have already done my work.
hi: मैं अपना काम कर चुका हूँ।

source: I said so.
hi: मैंने कहा था।

source: I had nothing to do with the group.
hi: मेरा उस ग्रुप के साथ कोई संबंध नहीं था।

source: I found it impossible to do the work in one day.
hi: मुझे एक दिन में काम खतम करना नामुमकिन लगा।

source: I had never seen her before that time.
hi: मैंने उसे पहले कभी नहीं देखा था।

source: I had met her many times before then.
hi: मैं उससे पहले कई बार मिल चुका था।

source: I have not seen him since then.
hi: मैंने उसे तबसे नहीं देखा है।

source: I was amazed at the speed of the car.
hi: मैं उस गाड़ी की रफ़तार देखकर हैरान रह गया।

source: I know both of the girls.
hi: मैं दोनों लड़कीयों को जानता हूँ।

source: I bet five pounds on the horse.
hi: मैंने उस घोड़े पर पाँच पाऊंड की बाज़ी लगाई।

source: I made the woman angry.
hi: मैंने उस औरत को गस्सा दिलाया।

source: I have just finished reading the book.
hi: मैंने अभी-अभी किताब को पढ़ना खतम किया है।

source: I am well acquainted with the subject.
hi: मैं इस विषय से परिचित हूँ।

source: I know nothing whatever about it.
hi: मुझे इसके बारे में कुछ भी नहीं पता।

source: I ordered those books from Germany.
hi: मैंने उन किताबों जो जर्मनी से खरीदकर मंगवाया था।

source: I have been taking care of him ever since.
hi: मैं तभी से उसकी देखभाल करता आया हूँ।

source: I got very sleepy.
hi: मुझे नींद आ गई।

source: I was waiting for a taxi.
hi: मैं टैक्सी का इंतेज़ार कर रहा था।

source: I have just cleaned my room.
hi: मैंने अपना कमरा अभी अभी साफ़ किया है।

source: I study very little.
hi: मैं बहुत कम पढ़ाई करता हूँ।

source: I like tennis.
hi: मुझे टेनिस पसंद है।

source: I'm tired of watching television.
hi: मैं टीवी देख देखकर थक गया हूँ।

source: I learned French instead of German.
hi: मैंने जर्मन की बजाय फ़्रानसीसी सीखी ।

source: At times I feel like quitting my job.
hi: मुझे कभी-कभी अपनी नौकरी छोड़ देने का मन करता है।

source: I like both.
hi: मुझे दोनो पसंद हैं।

source: I'm very thirsty.
hi: मुझे बहुत प्यास लगी है।

source: I have so many clothes I don't know what to wear tomorrow.
hi: मेरे पास इतने सारे कपड़े हैं कि मुझे समझ में नहीं आ रहा है कि कल क्या पहनूँ।

source: I sat between Tom and John.
hi: मैं टॉम और जॉन के बीच में बैठा।

source: I like flowers of every description.
hi: मुझे हर तरह के फूल पसंद हैं।

source: I like playing the piano.
hi: मुझे पियानो बजाना पसंद है।

source: I was tired to death.
hi: मैं थकान से मरा जा रहा था।

source: I met the president himself.
hi: मैं खुद राष्ट्रपति से मिला।

source: I take a bath almost every day.
hi: मैं लगभग हर रोज़ नहाता हूँ।

source: I was laughed at by everyone.
hi: सब लोग मुझपर हँसे।

source: I have another friend in China.
hi: चीन में मेरा और एक दोस्त है।

source: I got lost in the forest.
hi: मैं जंगल में खो गया।

source: I am often contrasted with my brother.
hi: मेरी अक्सर मेरे भाई के साथ बराबरी करी जाती है।

source: I used to go to school with Ken.
hi: मैं केन के साथ स्कूल जाता था।

source: I met her in London for the first time.
hi: मेरी उसके साथ पहली मुलाकात लंदन में हुई थी।

source: I'm a doctor.
hi: मैं डॉक्टर हूँ।

source: I am accustomed to living alone.
hi: मुझे अकेले रहने की आदत है।

source: I know a girl who can ride a unicycle.
hi: मेरे जान-पहचान की एक लड़की को युनिसायकल चलाना आता है।

source: I like swimming very much.
hi: मुझे तैरना बहुत पसंद है।

source: I can swim.
hi: मुझे तैरना आता है।

source: I can't even speak English very well, much less Spanish.
hi: स्पेनी छोड़ो, मैं तो अंग्रेज़ी भी अच्छी तरह से नहीं बोल पाता।

source: I am able to read English.
hi: मैं अंग्रेज़ी पढ़ सकता हूँ।

source: I like English and music.
hi: मुझे अंग्रेज़ी और संगीत पसंद हैं।

source: I am interested in English.
hi: मुझे अंग्रेज़ी में दिलचस्पी है।

source: I like studying English.
hi: मुझे अंग्रेज़ी पढ़ना अच्छा लगता है।

source: I can teach English.
hi: मैं अंग्रेज़ी पढ़ा सकता हूँ।

source: I don't like a novel without a hero.
hi: मुझें बिना नायकवाले उपन्यास पसंद नहीं हैं।

source: I'm just about to set off for the station.
hi: मैं स्टेशन के लिए निकलने वाला हूँ।

source: I met my teacher on the way to the station.
hi: मेरी स्टेशन के रास्ते पर अपनी टीचर से मुलाकात हुई।

source: I bought two dozen pencils.
hi: मैंने दो दर्जन पेनसिलें खरीदीं।

source: I don't know what to study.
hi: मुझे समझ में नहीं आ रहा कि क्या पढ़ूँ।

source: I went there dozens of times.
hi: मैं वहाँ दसियों बार जा चुका हूँ।

source: I have tried innumerable times to contact him.
hi: मैं बहुत बार उससे सम्पर्क करने की कोशिश कर चुकी हूँ।

source: I was at a loss when I lost my house key.
hi: जब मेरी घर की चाबी खो गई थी मुझे समझ में नहीं आ रहा था कि मैं क्या करूँ।

source: I'm studying kabuki drama.
hi: मैं काबुकी नाटक का अध्ययन कर रहा हूं।

source: I like mountains better than seas.
hi: मुझे सागरों से ज़्यादा पहाड़ियां पसंद हैं।

source: I wish to go to Paris to study art.
hi: मैं पैरिस जाकर आर्ट पढ़ना चाहता हूँ।

source: I took the opportunity to visit Rome.
hi: मैंने रोम जाने के मौका का फ़ायदा उठाया।

source: I have been to Kyoto.
hi: मैं क्योटो गया हुआ हूँ।

source: I work for a bank.
hi: मैं बैंक में काम करता हूँ।

source: I have to go to the bank.
hi: मुझे बैंक जाना है।

source: I came upon an old friend of mine on the train.
hi: मेरी ट्रेन में एक पुराने दोस्त से मुलाक़ात हुई।

source: I know your father.
hi: मैं तुम्हारे पिताजी को जानता हूँ।

source: I'm thinking about you.
hi: मैं तुम्हारे बारे में सोच रहा हूँ।

source: I am fully convinced of your innocence.
hi: मुझे तुम्हारे बेगुनाह होने पर पूरा यकीन है।

source: I had my brother repair my bicycle.
hi: मैंने अपने भाई से अपनी साईकल ठीक करवाई।

source: I saw a dog swim across the river.
hi: मैंने एक कुत्ते को तैरकर नदी पार करते हुए देखा।
